In [12]:
import numpy as np
import pandas as pd
d ={ 'Name' : ['Harry','John','Mary','Charly'],
    'Age' : [15,20,14,16,],
    'Rank' : [4,3,1,2]}
print('DataFrame')
df= pd.DataFrame(d)
df

DataFrame

     Name  Age  Rank
0   Harry   15     4
1    John   20     3
2    Mary   14     1
3  Charly   16     2

In [11]:
print('Sorted DataFrame')
df.sort_values(by=['Rank'],ascending=True)

Sorted DataFrame

     Name  Age  Rank
2    Mary   14     1
3  Charly   16     2
1    John   20     3
0   Harry   15     4